---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DirectShapeReferenceOptions Constructor
DirectShapeReferenceOptions Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | DirectShapeReferenceOptions()()()() | Constructs a new DirectShapeRefOptions instance with default settings. |
|  | DirectShapeReferenceOptions(DirectShapeReferenceOptions) | Constructs a new copy of the input DirectShapeRefOptions object. |

# See Also

DirectShapeReferenceOptions Class

DirectShapeReferenceOptions Members

Autodesk.Revit.DB Namespace